driver-tests/bpelse/assign/AssignJbi/test/echoDateDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoDateDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoDateDataType">
    <string>2008-11-15</string>
    <normalizedString>2008-11-15</normalizedString>
    <token>2008-11-15</token>
    <base64Binary>2008-11-15</base64Binary>
    <hexBinary>2008-11-15</hexBinary>
    <integer>2008-11-15</integer>
    <positiveInteger>2008-11-15</positiveInteger>
    <negativeInteger>2008-11-15</negativeInteger>
    <nonNegativeInteger>2008-11-15</nonNegativeInteger>
    <nonPositiveInteger>2008-11-15</nonPositiveInteger>
    <long>2008-11-15</long>
    <unsignedLong>2008-11-15</unsignedLong>
    <int>2008-11-15</int>
    <unsignedInt>2008-11-15</unsignedInt>
    <short>2008-11-15</short>
    <unsignedShort>2008-11-15</unsignedShort>
    <byte>2008-11-15</byte>
    <unsignedByte>2008-11-15</unsignedByte>
    <decimal>2008-11-15</decimal>
    <float>2008-11-15</float>
    <double>2008-11-15</double>
    <boolean>2008-11-15</boolean>
    <duration>2008-11-15</duration>
    <dateTime>2008-11-15</dateTime>
    <date>2008-11-15</date>
    <time>2008-11-15</time>
    <gYear>2008-11-15</gYear>
    <gYearMonth>2008-11-15</gYearMonth>
    <gMonth>2008-11-15</gMonth>
    <gMonthDay>2008-11-15</gMonthDay>
    <gDay>2008-11-15</gDay>
    <Name>2008-11-15</Name>
    <QName>2008-11-15</QName>
    <NCName>2008-11-15</NCName>
    <anyURI>2008-11-15</anyURI>
    <language>2008-11-15</language>
    <ID>2008-11-15</ID>
    <IDREF>2008-11-15</IDREF>
    <IDREFS>2008-11-15</IDREFS>
    <ENTITY>2008-11-15</ENTITY>
    <ENTITIES>2008-11-15</ENTITIES>
    <NMTOKEN>2008-11-15</NMTOKEN>
    <NMTOKENS>2008-11-15</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
